products/app/controllers/products_controller.rb

SELECT * FROM `products`
---
  def index
    @products = Product.all