products/app/controllers/social_controller.rb

SELECT * FROM `social_auths` WHERE (`social_auths`.`uid` = 'https://www.google.com/accounts/o8/id?id=AItOawnBujW7EpO8MiywDVZ01ToSHOj71fzxB2s' AND `social_auths`.`provider` = 'google') LIMIT 1
INSERT INTO `social_auths` (`created_at`, `updated_at`, `uid`, `user_id`, `user_name`, `provider`, `access_token`, `email`) VALUES('2012-10-21 11:32:03', '2012-10-21 11:32:03', 'https://www.google.com/accounts/o8/id?id=AItOawnBujW7EpO8MiywDVZ01ToSHOj71fzxB2s', '', 'harish kumar', 0, NULL, 'rayasamharish@gmail.com')
---
  def create
    omniauth = request.env["omniauth.auth"]
    authentication = SocialAuth.find_by_provider_and_uid(omniauth['provider'], omniauth['uid'])
    puts "omniauth #{omniauth}"
    if authentication
      session[:user] = "#{authentication.id}_#{authentication.provider}"
      session[:user_name] = "#{authentication.user_name}"
      redirect_to product_paginate_url
    else
      puts "omniauth #{omniauth['user_info']}"
      authentication = SocialAuth.new
      authentication.provider = omniauth['provider']
      authentication.uid = omniauth['uid']
      authentication.user_name = omniauth['user_info']['name']
      authentication.email = omniauth['user_info']['email']
      authentication.access_token = omniauth[:access_token]
      authentication.save